from docx.enum.text import WD_PARAGRAPH_ALIGNMENT
from docx.shared import RGBColor

from generation.tests_literals.fucas_literals import fucas_literals

def handle_executive_functions(parsed, document, literals, print_output = False):
    p1 = document.add_paragraph()

    fl = fucas_literals(parsed['fucas'])

    # input from Elena
    porisma = ""
    negs = ""
    post = ""
    if len(fl['individual_affected']) > 0:
        negs = f"διαπιστώθηκαν ελλείψεις στις ικανότητες {fl['affected']}"
        porisma += negs
    if len(fl['individual_unaffected']) > 0:
        post = f"δεν διαπιστώθηκαν ελλείψεις στις ικανότητες {fl['unaffected']}"
        if len(fl['individual_affected']) > 0:
            post = f". Σε αντίθεση, {post}"
        porisma += post

    printable_1 = f"Όσον αφορά την αξιολόγηση των σύνθετων και των απλών καθημερινών δραστηριοτήτων, η οποία έγινε μέσω της δοκιμασίας FUCAS, {porisma}.\n"
    p1.add_run(printable_1)
    p1.runs[0].font.color.rgb = RGBColor(255, 0, 0)

    # "δεν παρουσίαζε δυσκολίες σε ικανότητες που είναι απαραίτητες προκειμένου να ολοκληρωθεί σωστά η εκτέλεση σύνθετων νοητικών έργων/δραστηριοτήτων" epimerous = 0
    # "παρουσίαζε [σοβαρες] δυσκολίες σε ικανότητες που είναι απαραίτητες προκειμένου να ολοκληρωθεί σωστά η εκτέλεση σύνθετων νοητικών έργων/δραστηριοτήτων" epimerous = 2

    #understanding: δυσκολία να κατανοήσει απλές και σύνθετες οδηγίες προκειμένου να ανταπεξέλθει σε καθημερινές δραστηριότητες
    #prospective_memory: να θυμηθεί να πάρει το φάρμακό του την συγκεκριμένη ώρα, να θυμηθεί να κλείσει τον φούρνο, να θυμηθεί να πάει σε κάποιο ραντεβού
    #planning: να μπορεί να σχεδιάσει ένα ταξίδι, ένα γεύμα για πολλά άτομα, να οργανώσει την ημέρα του
    #time: παίρνει περισσότερο χρόνο από το συνηθισμένη για να ολοκληρώσει ικανότητες
    #sequence: 
    #accuracy: 
    #goal: 

    # Poptsi here
    printable_2 = f"Τα παραπάνω ευρήματα καταδεικνύουν πως {literals['full_with_article']} για το διάστημα που έλαβε χώρα η εξέταση, παρουσίαζε δυσκολίες σε ικανότητες που είναι απαραίτητες προκειμένου να ολοκληρωθεί σωστά η εκτέλεση σύνθετων νοητικών έργων/δραστηριοτήτων. \
    Πιθανά παραδείγματα που να σχετίζονται με την καθημερινή ζωή αφορούν τη δυσκολία του εξεταζόμενου να θυμηθεί ότι πρέπει να εκτελέσει κάποιο έργο σε συγκεκριμένο χρονικό διάστημα, όπως πχ να πάρει σωστά και στην ώρα της την φαρμακευτική του αγωγή που λάμβανε, ή να σχεδιάσει ένα ταξίδι, να επιλύσει μια σύνθετη δραστηριότητα που απαιτεί σύνθετη σκέψη. \
    Οι παραπάνω δυσκολίες στην εκτελεστική λειτουργία φαίνεται να επηρέαζαν την καθημερινή ζωή {literals['examinee_gender']}, με αποτέλεσμα, να χρήζει υπενθύμισης (π.χ. με ρολόι ή λεκτική υπενθύμιση μέσω τρίτων), αλλά και βοήθεια προκειμένου να φέρει σε πέρας αποτελεσματικά σύνθετα νοητικά έργα/δραστηριότητες της καθημερινής ζωής. \
    Ωστόσο, μέσα από την αντικειμενική εκτίμηση {literals['the_same']} φάνηκε ότι για το διάστημα που διενεργήθηκε η εκτίμηση {literals['full_with_article']} δεν αντιμετώπιζε ιδιαίτερα προβλήματα στο να εκτελεί πιο απλές καθημερινές δραστηριότητες όπως είναι η ικανότητα ένδυσης και ατομικής υγιεινής (πλύσιμο χεριών)."
    p1.add_run(printable_2)
    p1.runs[1].font.color.rgb = RGBColor(255, 0, 0)

    if print_output:
        print(printable_1)
        print(printable_2)

    p1.alignment = WD_PARAGRAPH_ALIGNMENT.JUSTIFY