from docx.enum.text import WD_PARAGRAPH_ALIGNMENT

def handle_memory_conclusions(parsed, document, literals, print_output = False):
    p1 = document.add_paragraph()

    # input from Elena
    p1.add_run(f"Οι παραπάνω επιδόσεις στην μνήμη επεισοδίων συνηγορούν υπέρ δυσκολιών από την πλευρά {literals['examinee_gender']} όσον αφορά στην ικανότητα λεκτικής και οπτικής μάθησης αλλά και συγκράτησης καινούριων πληροφοριών προκειμένου να ανασύρει από την μακρόχρονη μνήμη αποτελεσματικά νέες πληροφορίες. Σε επίπεδο καθημερινής ζωής τα παραπάνω ελλείμματα μεταφράζονται σε δυσκολία {literals['examinee_gender']} να θυμηθεί πληροφορίες που έχουν επεξεργαστεί λεκτικά, όπως να θυμηθεί συζητήσεις τις οποίες έχει κάνει, πληροφορίες τις οποίες άκουσε στην τηλεόραση, ποιος είναι ο κωδικός από το κινητό τηλέφωνο, ποιος είναι ο καινούριος τηλεφωνικός αριθμός της κόρης κτλ. Τα ελλείμματα σε επίπεδο οπτικής μνήμης επεισοδίων, μεταφράζονται σε δυσκολίες {literals['examinee_gender']} να θυμηθεί τον χώρο που έχει τοποθετήσει προσωπικά {literals['article_v3']} αντικείμενα, το σημείο στο οποίο βρίσκεται ένα συγκεκριμένο σούπερ μάρκετ κτλ.")

    p1.alignment = WD_PARAGRAPH_ALIGNMENT.JUSTIFY